// import './App.css'
import { Link } from 'react-router-dom'
import { styled } from '@linaria/react'
import Cover from '../components/Cover'
import NavBar from '../components/NavBar'
import BigIcon from '../components/BigIcon'
import Footer from '../components/Footer'

const App = () => {
  return (
    <StyledApp>
      <BigIcon />
      <NavBar />
      <Cover />

      <StyledContents>
        <div>
          <h1>Vite + React</h1>
          <p>
            Edit <code>src/App.tsx</code> and save to test HMR
            ベッドを購入する際、直接ベッドに寝転がってみたり、店員さんと直接話しをして、購入するほうが失敗しにくいという意見の方が多いかと思います。ただ、大事な睡眠に関わるベッドだから色んなものを見て選びたいという方には、通販で一度いろんなベッドをみてまわる、という方法があります。ネットの通販であれば、家にいながらいろんなお店のベッドを見てまわることが出来ます。素材やサイズは基本的にはサイトに書いてありますし、最近では購入者のレビューも沢山掲載されている通販サイトもありますので、ベッドの寝心地の参考にするのもよいでしょう。実際の店舗へ行く前に、ネットの通販で下調べする。このようなベッドの買い方も、効率的で、悪くないと思います。神田でマンションを探す際、まずは神田という街がどのような街であるかを把握するのがよいでしょう。
          </p>
          <p>
            神田は山手線で東京駅の次の駅です。中央線や銀座線も通っていますので、非常に交通の便がよいです。オフィス街なので、スーパーなどは少ないですが、そのかわり居酒屋やカラオケなどはかなり沢山あります。また、平日はサラリーマンで賑わいますが、土日は閑静です。神田のマンションは駅周辺にもありますが、徒歩3分以上の場所に比較的多く存在しています。賃貸しのマンションもありますが、家賃は決して安くありません。学生さんにはあまり向かない条件の土地ですが、会社のすぐ近くにマンションを買いたい、マンションを借りたい、という方にはおすすめです。
          </p>
          <p>
            Edit <code>src/App.tsx</code> and save to test HMR
            ベッドを購入する際、直接ベッドに寝転がってみたり、店員さんと直接話しをして、購入するほうが失敗しにくいという意見の方が多いかと思います。ただ、大事な睡眠に関わるベッドだから色んなものを見て選びたいという方には、通販で一度いろんなベッドをみてまわる、という方法があります。ネットの通販であれば、家にいながらいろんなお店のベッドを見てまわることが出来ます。素材やサイズは基本的にはサイトに書いてありますし、最近では購入者のレビューも沢山掲載されている通販サイトもありますので、ベッドの寝心地の参考にするのもよいでしょう。実際の店舗へ行く前に、ネットの通販で下調べする。このようなベッドの買い方も、効率的で、悪くないと思います。神田でマンションを探す際、まずは神田という街がどのような街であるかを把握するのがよいでしょう。
          </p>
          <p>
            神田は山手線で東京駅の次の駅です。中央線や銀座線も通っていますので、非常に交通の便がよいです。オフィス街なので、スーパーなどは少ないですが、そのかわり居酒屋やカラオケなどはかなり沢山あります。また、平日はサラリーマンで賑わいますが、土日は閑静です。神田のマンションは駅周辺にもありますが、徒歩3分以上の場所に比較的多く存在しています。賃貸しのマンションもありますが、家賃は決して安くありません。学生さんにはあまり向かない条件の土地ですが、会社のすぐ近くにマンションを買いたい、マンションを借りたい、という方にはおすすめです。
          </p>
          <p>
            Edit <code>src/App.tsx</code> and save to test HMR
            ベッドを購入する際、直接ベッドに寝転がってみたり、店員さんと直接話しをして、購入するほうが失敗しにくいという意見の方が多いかと思います。ただ、大事な睡眠に関わるベッドだから色んなものを見て選びたいという方には、通販で一度いろんなベッドをみてまわる、という方法があります。ネットの通販であれば、家にいながらいろんなお店のベッドを見てまわることが出来ます。素材やサイズは基本的にはサイトに書いてありますし、最近では購入者のレビューも沢山掲載されている通販サイトもありますので、ベッドの寝心地の参考にするのもよいでしょう。実際の店舗へ行く前に、ネットの通販で下調べする。このようなベッドの買い方も、効率的で、悪くないと思います。神田でマンションを探す際、まずは神田という街がどのような街であるかを把握するのがよいでしょう。
          </p>
          <p>
            神田は山手線で東京駅の次の駅です。中央線や銀座線も通っていますので、非常に交通の便がよいです。オフィス街なので、スーパーなどは少ないですが、そのかわり居酒屋やカラオケなどはかなり沢山あります。また、平日はサラリーマンで賑わいますが、土日は閑静です。神田のマンションは駅周辺にもありますが、徒歩3分以上の場所に比較的多く存在しています。賃貸しのマンションもありますが、家賃は決して安くありません。学生さんにはあまり向かない条件の土地ですが、会社のすぐ近くにマンションを買いたい、マンションを借りたい、という方にはおすすめです。
          </p>
          <p>
            Edit <code>src/App.tsx</code> and save to test HMR
            ベッドを購入する際、直接ベッドに寝転がってみたり、店員さんと直接話しをして、購入するほうが失敗しにくいという意見の方が多いかと思います。ただ、大事な睡眠に関わるベッドだから色んなものを見て選びたいという方には、通販で一度いろんなベッドをみてまわる、という方法があります。ネットの通販であれば、家にいながらいろんなお店のベッドを見てまわることが出来ます。素材やサイズは基本的にはサイトに書いてありますし、最近では購入者のレビューも沢山掲載されている通販サイトもありますので、ベッドの寝心地の参考にするのもよいでしょう。実際の店舗へ行く前に、ネットの通販で下調べする。このようなベッドの買い方も、効率的で、悪くないと思います。神田でマンションを探す際、まずは神田という街がどのような街であるかを把握するのがよいでしょう。
          </p>
          <p>
            神田は山手線で東京駅の次の駅です。中央線や銀座線も通っていますので、非常に交通の便がよいです。オフィス街なので、スーパーなどは少ないですが、そのかわり居酒屋やカラオケなどはかなり沢山あります。また、平日はサラリーマンで賑わいますが、土日は閑静です。神田のマンションは駅周辺にもありますが、徒歩3分以上の場所に比較的多く存在しています。賃貸しのマンションもありますが、家賃は決して安くありません。学生さんにはあまり向かない条件の土地ですが、会社のすぐ近くにマンションを買いたい、マンションを借りたい、という方にはおすすめです。
          </p>
        </div>
        <Link to="/Foo"><p>To ABC Page</p></Link>
        <p>This Website is produced by cyan.</p>
      </StyledContents>
      <Footer />
    </StyledApp>
  )
}

const StyledApp = styled.div`
  background: #1f1f1f;
  color: #cfcfcf;
`

const StyledContents = styled.div`
  width: 728px;
  margin: auto;
`



export default App
